## Plan Result (prod-sendgrid)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 16 to change, 4 to destroy.</code></pre>

* Update
  * module.access_management.sendgrid_api_key.subuser
  * module.adoption.sendgrid_api_key.subuser
  * module.civil.sendgrid_api_key.subuser
  * module.cmc.sendgrid_api_key.subuser
  * module.damages.sendgrid_api_key.subuser
  * module.db_reporting.sendgrid_api_key.subuser
  * module.dcs.sendgrid_api_key.subuser
  * module.divorce.sendgrid_api_key.subuser
  * module.employment_tribunals.sendgrid_api_key.subuser
  * module.nessus.sendgrid_api_key.subuser
  * module.panorama.sendgrid_api_key.subuser
  * module.payment.sendgrid_api_key.subuser
  * module.pcol.sendgrid_api_key.subuser
  * module.private_law.sendgrid_api_key.subuser
  * module.reference_data.sendgrid_api_key.subuser
  * module.sscs.sendgrid_api_key.subuser
* Replace
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.access_management.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "8eM-b17OSnKI0SDwXHbz-g"
        name    = "access-management-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.adoption.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "O4MxI0wzRkm8gJ382sVaIw"
        name    = "adoption-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.civil.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "vc-kKa0uQKuWe2nU96GZBQ"
        name    = "civil-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.cmc.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "bS4gYtoxRJOlYQfiwM7OKA"
        name    = "cmc-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.damages.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "VUfeNZB9RKmZObAfUAJ_xA"
        name    = "damages-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.db_reporting.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "_BTddrZuT8ilhnnbtl3Aiw"
        name    = "db-reporting-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.dcs.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "3Cw-nmL4RwifUAJv5bAoOw"
        name    = "dcs-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.divorce.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "JAwVFVReQY6eVePTHK-klw"
        name    = "divorce-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.employment_tribunals.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "0i4eghaOTKekkXT5esXqAw"
        name    = "employment-tribunals-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.nessus.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "JPZGNftRRbirrjqY0Caa2g"
        name    = "nessus-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.panorama.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "7cw54Kk3THyhCaCEeaJD6A"
        name    = "panorama-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.payment.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "I5BqY9oiQsqcVX3nxyngMg"
        name    = "payment-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.pcol.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "OvVs9gE0QiWYYOWSGXBaiA"
        name    = "pcol-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] must be replaced
-/+ resource "sendgrid_domain_authentication" "domain-authenticate" {
      + custom_dkim_selector = "prd" # forces replacement
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "prd.domainkey.u33702743.wl244.sendgrid.net"
              - host  = "prd._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "prd2.domainkey.u33702743.wl244.sendgrid.net"
              - host  = "prd2._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u33702743.wl244.sendgrid.net"
              - host  = "em6018.hmcts.net"
              - type  = "cname"
              - valid = false
            },
        ] -> (known after apply)
      ~ id                   = "17885169" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ subdomain            = "em6018" -> (known after apply)
      ~ username             = "hmcts-pcol-prod" -> (known after apply)
      ~ valid                = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record1" {
      ~ fqdn                = "prd._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/prd._domainkey" -> (known after apply)
      ~ name                = "prd._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "prd.domainkey.u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record2" {
      ~ fqdn                = "prd2._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/prd2._domainkey" -> (known after apply)
      ~ name                = "prd2._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "prd2.domainkey.u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record3" {
      ~ fqdn                = "em6018.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/em6018" -> (known after apply)
      ~ name                = "em6018" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.private_law.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "l4oRxHouTiGymPYcNWHSCA"
        name    = "private-law-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.reference_data.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "gcWRpImqSneFu_ShaJlB5Q"
        name    = "reference-data-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.sscs.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "lioBiRURQ7KoPaTM-KluRw"
        name    = "sscs-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 16 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":60,"Program":"tfcmt","SHA1":"","Target":"prod-sendgrid","Vars":{}} -->